# '===========Переменные=========='
# Переменная  - это ссылка на ячейку памяти, где хранятся какието данные, для дальнейшего использования этих данных при помощи обращения к названию переменной.

# print(number1 + number2)

# '========Правила наименования переменных========'
# a = 5 # Можно, но назначение не понятно
# # 125number = 123 # Нельзя начинать названия с чисел
# # my-name = 'katana' - # Нельзя испльзовать в названии символы, кроме _ (my_name)
# # hello world - Нельзя использовать символы, кроме _
# # print = 12 - Нельзя называть переменные ключевыми словами и названиями функций

# # Snake Case - puthon стиль наименования переменной
# my_name = 'Emir'

# # Camel Case = стиль остальных языков программирования
# myName = 'Emir'

# '=======Ввод и вывод данных======='
# # print - функция вывода данных в терминал
# # input - функция ввода данных в терминал

# number = input("Введите число: ")
# print(number)

# name = input("Ведите имя: ")
# surname = input("Введите фамилию: ")
# print(name, surname)

# num1 = int(input("Введите первое число: "))
# num2 = int(input("Введите второе число: "))
# print(num1 + num2)

'=======Типы данных======'
# Типы данных делятся на 2 вида: изменяемые и неизменяемые

# Изменяемые: list(список), dict(словарь), set(множество)
# Неизменяемые: int(число), float(вещественные), desimal(вещественные), str(Срока), tuple(картежи), bool(булевые), frozenset(не изменяемые сеты), complex, None(пустота)
